art/note/chapter07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-19 Mon 01:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bus</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Bus</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org08bb29e">1. Intro</a></li>
<li><a href="#orga5e0f8e">2. The Basic Concept about Bus</a>
<ul>
<li><a href="#orgf931cf9">2.1. The Concept</a></li>
</ul>
</li>
<li><a href="#org9fd01d2">3. The Classification and Parameters</a>
<ul>
<li><a href="#org82e76fe">3.1. The classification</a>
<ul>
<li><a href="#org34afd95">3.1.1. System Bus</a></li>
<li><a href="#org27ba075">3.1.2. Communication Bus (zan ding)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5b0a2df">4. The Structure of Bus and Bus Protocol</a>
<ul>
<li><a href="#orgfe90c1e">4.1. The structure of Bus</a></li>
<li><a href="#orgf73ef27">4.2. <span class="todo TODO">TODO</span> Multi-bus and Examples</a></li>
<li><a href="#orga38dc15">4.3. <span class="todo TODO">TODO</span> Bus Protocol</a></li>
</ul>
</li>
<li><a href="#org7cdf829">5. The Arbitration and Communication of Bus</a>
<ul>
<li><a href="#orgec8c119">5.1. <span class="todo TODO">TODO</span> The Arbitration</a></li>
<li><a href="#orga9b79b3">5.2. <span class="todo TODO">TODO</span> Bus Communication Control (zan ding)</a>
<ul>
<li><a href="#orgaee9686">5.2.1. Synchronous Timing</a></li>
<li><a href="#org4082a35">5.2.2. Asynchronous Timing</a></li>
<li><a href="#org28001f6">5.2.3. Half-Synchronous Timing</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org08bb29e" class="outline-2">
<h2 id="org08bb29e"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-06-19 Mon 00:13] </span></span> <br />
Some of the chapter is marked with (zan ding) it means the translation of the name is a temporary one.</li>
</ul>

<p>
Bus is not difficult. Here is the table of contents: 
</p>

<ol class="org-ol">
<li>The Basic Concepts about Bus</li>
<li>The Classification and Parameters</li>
<li>The Structure of Bus and Bus Protocol</li>
<li>The Aribitration and Communication of Bus</li>
</ol>

<p>
This note is arranged differently from Tang's Garbage Book. You should be aware of it.
</p>
</div>
</div>


<div id="outline-container-orga5e0f8e" class="outline-2">
<h2 id="orga5e0f8e"><span class="section-number-2">2</span> The Basic Concept about Bus</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf931cf9" class="outline-3">
<h3 id="orgf931cf9"><span class="section-number-3">2.1</span> The Concept</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The components of the computer system (which are processor, cache, memory, I/O device, external memory) are connected to each other by the means of linking the data line (or the control line, something like that) to the bus. 
</p>

<p>
Anyway, if there is picture you should understand it well.
</p>

<p>
You can check the book for more information. (I just don't wanna copy them you know. Tang is not writing wrong this time).
</p>
</div>
</div>
</div>

<div id="outline-container-org9fd01d2" class="outline-2">
<h2 id="org9fd01d2"><span class="section-number-2">3</span> The Classification and Parameters</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org82e76fe" class="outline-3">
<h3 id="org82e76fe"><span class="section-number-3">3.1</span> The classification</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-06-18 Sun 22:22] </span></span> <br />
You should also notice that the classfication is not strictly right. Don't be too yuanjiao zhuyi.</li>
</ul>

<p>
The section is very absurd here. It doesn't tell the how bus is categorized but tells about how it is composed.
</p>

<p>
Anyway, let us just focus on what Tang said. You should just have a look. There are two kinds of the buses: 
</p>
<ol class="org-ol">
<li><b>System Bus</b>, which is composed by
<ol class="org-ol">
<li>Data Bus</li>
<li>Address Bus</li>
<li>Control Bus</li>
</ol></li>
<li><b>Communication Bus</b>: This one is shit.</li>
</ol>
</div>

<div id="outline-container-org34afd95" class="outline-4">
<h4 id="org34afd95"><span class="section-number-4">3.1.1</span> System Bus</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The system bus is the <b>biggest</b> bus, which connects all the parts of the computer together, that is, for example, if processor and memory wants to communicate with each other, that is they want to exchange some blocks of data with each other, the address and the data are transferred to bus and then transferred to the relative part.
</p>

<p>
You may see the very picture on CSAPP where the intro chapter outlined the computer system; it tells about the system bus.
</p>

<p>
Moreover the system bus usually have three components: <b>1. Data Bus; 2. Address Bus; 3. Control Bus.</b>
Data Bus is used to transfer data. It is usually like a word wide that is 32-bit wide (or it can be 16-bit wide idk). Address Bus  is for address, as the name has suggested. Control bus is used to transfer some control signal. For example the clock pulse and the write enable signal and read enable signal.
</p>
</div>
</div>

<div id="outline-container-org27ba075" class="outline-4">
<h4 id="org27ba075"><span class="section-number-4">3.1.2</span> Communication Bus (zan ding)</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This section is shit. According to Tang: 
</p>
<blockquote>
<p>
The type of the bus is used for the communication among computer systems or between a computer system and other system.
</p>
</blockquote>
<p>
Tang wanted to talk about something, but she did not know what is called, so she just faked one.
</p>

<p>
Absolutely shit. You should just remember that the communication bus is the wire for transferring data between long distance. There are two strategies: 1. serial; 2. parrallel.
</p>

<p>
Things are easy here.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b0a2df" class="outline-2">
<h2 id="org5b0a2df"><span class="section-number-2">4</span> The Structure of Bus and Bus Protocol</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfe90c1e" class="outline-3">
<h3 id="orgfe90c1e"><span class="section-number-3">4.1</span> The structure of Bus</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The structure of Bus actually tells a general principle of the design of the bus, that is, <b>if two parts with different speed are connected directly, the performance of the high-speed one is slowed down</b>. Idk why it is right, but it seems right. 
</p>

<p>
The principle tells us about the structure of the bus. <b>You should connect the parts with the same speed to the same bus</b>. For example, there are many types of I/O devices, some of then are high-speed and some of them are low-speed. The PCI <b>protocol</b> implements a high-speed bus for internet connection and multi-media devices and a extensible bus for FAX or something like that.
</p>

<p>
Here comes the protocol. Idk what protocol is either. But you can just leave it for now.
</p>
</div>
</div>

<div id="outline-container-orgf73ef27" class="outline-3">
<h3 id="orgf73ef27"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Multi-bus and Examples</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This part sucks. I don't wanna take note about it.
</p>
</div>
</div>

<div id="outline-container-orga38dc15" class="outline-3">
<h3 id="orga38dc15"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Bus Protocol</h3>
</div>
</div>

<div id="outline-container-org7cdf829" class="outline-2">
<h2 id="org7cdf829"><span class="section-number-2">5</span> The Arbitration and Communication of Bus</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgec8c119" class="outline-3">
<h3 id="orgec8c119"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> The Arbitration</h3>
</div>

<div id="outline-container-orga9b79b3" class="outline-3">
<h3 id="orga9b79b3"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> Bus Communication Control (zan ding)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The Bus Communication Control main solve the problem how two part communicate (that is how they exchange blocks of data). 
</p>

<p>
This section is copied from Stallings' book, where the section is called the <i>Timing</i> of the Bus, where the read and write operations are just examples for better reading. Maybe, you should consider just reading Stallings instead of reading Tang's shitty book.
</p>
</div>

<div id="outline-container-orgaee9686" class="outline-4">
<h4 id="orgaee9686"><span class="section-number-4">5.2.1</span> Synchronous Timing</h4>
</div>

<div id="outline-container-org4082a35" class="outline-4">
<h4 id="org4082a35"><span class="section-number-4">5.2.2</span> Asynchronous Timing</h4>
</div>

<div id="outline-container-org28001f6" class="outline-4">
<h4 id="org28001f6"><span class="section-number-4">5.2.3</span> Half-Synchronous Timing</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-06-19 Mon 01:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>